{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<PAD>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<UNK>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<CLS>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<SEP>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "<MASK>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 5,
      "content": "<COL1>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 6,
      "content": "<CONT>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "<CLS>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<SEP>",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "SpecialToken": {
          "id": "<CLS>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<SEP>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      },
      {
        "SpecialToken": {
          "id": "<SEP>",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "<CLS>": {
        "id": "<CLS>",
        "ids": [
          2
        ],
        "tokens": [
          "<CLS>"
        ]
      },
      "<SEP>": {
        "id": "<SEP>",
        "ids": [
          3
        ],
        "tokens": [
          "<SEP>"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "<UNK>",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<PAD>": 0,
      "<UNK>": 1,
      "<CLS>": 2,
      "<SEP>": 3,
      "<MASK>": 4,
      "<COL1>": 5,
      "<CONT>": 6,
      "&": 7,
      "'": 8,
      "(": 9,
      ")": 10,
      "*": 11,
      ",": 12,
      ".": 13,
      "/": 14,
      "0": 15,
      "1": 16,
      "2": 17,
      "3": 18,
      "4": 19,
      "5": 20,
      "6": 21,
      "7": 22,
      "8": 23,
      "9": 24,
      "<": 25,
      "=": 26,
      ">": 27,
      "@": 28,
      "A": 29,
      "B": 30,
      "C": 31,
      "D": 32,
      "E": 33,
      "F": 34,
      "G": 35,
      "H": 36,
      "I": 37,
      "J": 38,
      "K": 39,
      "L": 40,
      "M": 41,
      "N": 42,
      "O": 43,
      "P": 44,
      "R": 45,
      "S": 46,
      "T": 47,
      "U": 48,
      "V": 49,
      "W": 50,
      "X": 51,
      "Y": 52,
      "CO": 53,
      "L1": 54,
      "COL1": 55,
      "//": 56,
      "SY": 57,
      "SYS": 58,
      "DD": 59,
      "UT": 60,
      "IN": 61,
      "SP": 62,
      "),": 63,
      "AS": 64,
      "TE": 65,
      "ASS": 66,
      "DS": 67,
      "CL": 68,
      "CLASS": 69,
      "OUT": 70,
      "DI": 71,
      "DSN": 72,
      "DISP": 73,
      "PR": 74,
      "=(": 75,
      "AC": 76,
      "JO": 77,
      "JOB": 78,
      "EX": 79,
      "SYSOUT": 80,
      "HR": 81,
      "SHR": 82,
      "TL": 83,
      "STE": 84,
      "STEP": 85,
      "=*": 86,
      "EC": 87,
      "EXEC": 88,
      "LE": 89,
      "MS": 90,
      "OR": 91,
      "SYSPR": 92,
      "INT": 93,
      "SYSPRINT": 94,
      "',": 95,
      "/*": 96,
      "GCLASS": 97,
      "),'": 98,
      "MSGCLASS": 99,
      "DA": 100,
      "GM": 101,
      "PGM": 102,
      "LI": 103,
      "UN": 104,
      "LIB": 105,
      "SYSIN": 106,
      "ORT": 107,
      "SORT": 108,
      "NE": 109,
      ",(": 110,
      "IT": 111,
      "SYSDA": 112,
      "SPAC": 113,
      "UNIT": 114,
      "SPACE": 115,
      "MY": 116,
      "12": 117,
      "STEP1": 118,
      "PRO": 119,
      "ILE": 120,
      "00": 121,
      "PUT": 122,
      "ETL": 123,
      "YL": 124,
      "PT": 125,
      "RPT": 126,
      "NEW": 127,
      "CT": 128,
      "ACCT": 129,
      "DE": 130,
      "CA": 131,
      "SE": 132,
      "RE": 133,
      "FILE": 134,
      "BA": 135,
      "IE": 136,
      "ID": 137,
      "TR": 138,
      "55": 139,
      "ST": 140,
      "SYSUT": 141,
      "CYL": 142,
      "TLG": 143,
      "LETE": 144,
      "DELETE": 145,
      "CATLG": 146,
      ")),": 147,
      "IL": 148,
      "=&": 149,
      "GY": 150,
      "IGY": 151,
      "OA": 152,
      "DBA": 153,
      "OAD": 154,
      "OP": 155,
      "OPS": 156,
      "GE": 157,
      "PROC": 158,
      "CON": 159,
      "OUTPUT": 160,
      "INPUT": 161,
      "CH": 162,
      "AM": 163,
      "SYSUT1": 164,
      "TRK": 165,
      "MP": 166,
      "COMP": 167,
      "DU": 168,
      "MMY": 169,
      "DUMMY": 170,
      "IEB": 171,
      "PROD": 172,
      "LOAD": 173,
      "AB": 174,
      "CD": 175,
      "12CD": 176,
      "AB12CD": 177,
      "500": 178,
      "55500": 179,
      "555000": 180,
      "34": 181,
      "56": 182,
      "1234": 183,
      "123456": 184,
      "012": 185,
      "78": 186,
      "9012": 187,
      "789012": 188,
      "STEPLIB": 189,
      "01": 190,
      "DAIL": 191,
      "DAILY": 192,
      "NER": 193,
      "GENER": 194,
      "IEBGENER": 195,
      "MAS": 196,
      "TER": 197,
      "MASTER": 198,
      "AW": 199,
      "RAW": 200,
      "STG": 201,
      "WOR": 202,
      "TEST": 203,
      "WORK": 204,
      "UTIL": 205,
      "IDX": 206,
      "EA": 207,
      "YEA": 208,
      "USE": 209,
      "USER": 210,
      "YEAR": 211,
      "ETLOPS": 212,
      "ING": 213,
      "ACCTING": 214,
      "CRE": 215,
      "OPSCRE": 216,
      "OPSCREW": 217,
      "TEAM": 218,
      "RPTTEAM": 219,
      "PY": 220,
      "COPY": 221,
      "EXTR": 222,
      "LIN": 223,
      "JOB00": 224,
      "MYJOB00": 225,
      "MYJOB001": 226,
      "EM": 227,
      "MEM": 228,
      "SET": 229,
      "RECON": 230,
      "RECONJOB": 231,
      "BT": 232,
      "ACCTBT": 233,
      "ACCTBTCH": 234,
      "ETLEXTR": 235,
      "ETLEXTR3": 236,
      "N01": 237,
      "RPTGE": 238,
      "RPTGEN01": 239,
      "DL": 240,
      "YLOAD": 241,
      "DLYLOAD": 242,
      "DLYLOAD2": 243,
      "SYSUT2": 244,
      "ES": 245,
      "FY": 246,
      "IFY": 247,
      "LT": 248,
      "LSE": 249,
      "NO": 250,
      "RLSE": 251,
      "TIFY": 252,
      "UID": 253,
      "SYSUID": 254,
      "INFILE": 255,
      "OUTFILE": 256,
      "STEP2": 257,
      "PROCES": 258,
      "COND": 259,
      "NOTIFY": 260,
      "PROCESS": 261,
      "))": 262,
      "0M": 263,
      "CR": 264,
      "CTL": 265,
      "GI": 266,
      "ON": 267,
      "PASS": 268,
      "SYSLIN": 269,
      "REGI": 270,
      "IGYCR": 271,
      "COMPILE": 272,
      "REGION": 273,
      "IGYCRCTL": 274,
      "10": 275,
      "FIE": 276,
      "LDS": 277,
      "SORTIN": 278,
      "SORTOUT": 279,
      "SORTSTEP": 280,
      "FIELDS": 281,
      "SIGY": 282,
      "SIGYCOMP": 283,
      "SYSLIB": 284,
      "UNDE": 285,
      "UNDEF": 286,
      "CAMS": 287,
      "IDCAMS": 288,
      "NAM": 289,
      "BAD": 290,
      "NAME": 291,
      "OV": 292,
      "RDD": 293,
      "OVRDD": 294,
      "(&": 295,
      "RUN": 296,
      "CE": 297,
      "ICE": 298,
      "OL": 299,
      "OOL": 300,
      "TOOL": 301,
      "ICETOOL": 302,
      "14": 303,
      "BR": 304,
      "FBR": 305,
      "IEFBR": 306,
      "IEFBR14": 307,
      "EF": 308,
      "IK": 309,
      "JEF": 310,
      "T01": 311,
      "IKJEF": 312,
      "IKJEFT01": 313,
      "PROG": 314,
      "..": 315,
      "(),'": 316,
      "IEBCOPY": 317,
      "RPTPROC": 318,
      "ETLPROC": 319,
      "HLI": 320,
      "IEHLI": 321,
      "IEHLIST": 322,
      "MYPROC": 323,
      "DEV": 324,
      "@@": 325,
      "CONT": 326,
      "KLIB": 327,
      "LINKLIB": 328,
      ".,": 329,
      "1BAD": 330,
      "ACT": 331,
      "EXTRACT": 332,
      "AIN": 333,
      "MAIN": 334,
      "DR": 335,
      "ER": 336,
      "IV": 337,
      "DRIV": 338,
      "DRIVER": 339,
      "PORT": 340,
      "REPORT": 341,
      "LOA": 342
    },
    "merges": [
      [
        "C",
        "O"
      ],
      [
        "L",
        "1"
      ],
      [
        "CO",
        "L1"
      ],
      [
        "/",
        "/"
      ],
      [
        "S",
        "Y"
      ],
      [
        "SY",
        "S"
      ],
      [
        "D",
        "D"
      ],
      [
        "U",
        "T"
      ],
      [
        "I",
        "N"
      ],
      [
        "S",
        "P"
      ],
      [
        ")",
        ","
      ],
      [
        "A",
        "S"
      ],
      [
        "T",
        "E"
      ],
      [
        "AS",
        "S"
      ],
      [
        "D",
        "S"
      ],
      [
        "C",
        "L"
      ],
      [
        "CL",
        "ASS"
      ],
      [
        "O",
        "UT"
      ],
      [
        "D",
        "I"
      ],
      [
        "DS",
        "N"
      ],
      [
        "DI",
        "SP"
      ],
      [
        "P",
        "R"
      ],
      [
        "=",
        "("
      ],
      [
        "A",
        "C"
      ],
      [
        "J",
        "O"
      ],
      [
        "JO",
        "B"
      ],
      [
        "E",
        "X"
      ],
      [
        "SYS",
        "OUT"
      ],
      [
        "H",
        "R"
      ],
      [
        "S",
        "HR"
      ],
      [
        "T",
        "L"
      ],
      [
        "S",
        "TE"
      ],
      [
        "STE",
        "P"
      ],
      [
        "=",
        "*"
      ],
      [
        "E",
        "C"
      ],
      [
        "EX",
        "EC"
      ],
      [
        "L",
        "E"
      ],
      [
        "M",
        "S"
      ],
      [
        "O",
        "R"
      ],
      [
        "SYS",
        "PR"
      ],
      [
        "IN",
        "T"
      ],
      [
        "SYSPR",
        "INT"
      ],
      [
        "'",
        ","
      ],
      [
        "/",
        "*"
      ],
      [
        "G",
        "CLASS"
      ],
      [
        "),",
        "'"
      ],
      [
        "MS",
        "GCLASS"
      ],
      [
        "D",
        "A"
      ],
      [
        "G",
        "M"
      ],
      [
        "P",
        "GM"
      ],
      [
        "L",
        "I"
      ],
      [
        "U",
        "N"
      ],
      [
        "LI",
        "B"
      ],
      [
        "SYS",
        "IN"
      ],
      [
        "OR",
        "T"
      ],
      [
        "S",
        "ORT"
      ],
      [
        "N",
        "E"
      ],
      [
        ",",
        "("
      ],
      [
        "I",
        "T"
      ],
      [
        "SYS",
        "DA"
      ],
      [
        "SP",
        "AC"
      ],
      [
        "UN",
        "IT"
      ],
      [
        "SPAC",
        "E"
      ],
      [
        "M",
        "Y"
      ],
      [
        "1",
        "2"
      ],
      [
        "STEP",
        "1"
      ],
      [
        "PR",
        "O"
      ],
      [
        "I",
        "LE"
      ],
      [
        "0",
        "0"
      ],
      [
        "P",
        "UT"
      ],
      [
        "E",
        "TL"
      ],
      [
        "Y",
        "L"
      ],
      [
        "P",
        "T"
      ],
      [
        "R",
        "PT"
      ],
      [
        "NE",
        "W"
      ],
      [
        "C",
        "T"
      ],
      [
        "AC",
        "CT"
      ],
      [
        "D",
        "E"
      ],
      [
        "C",
        "A"
      ],
      [
        "S",
        "E"
      ],
      [
        "R",
        "E"
      ],
      [
        "F",
        "ILE"
      ],
      [
        "B",
        "A"
      ],
      [
        "I",
        "E"
      ],
      [
        "I",
        "D"
      ],
      [
        "T",
        "R"
      ],
      [
        "5",
        "5"
      ],
      [
        "S",
        "T"
      ],
      [
        "SYS",
        "UT"
      ],
      [
        "C",
        "YL"
      ],
      [
        "TL",
        "G"
      ],
      [
        "LE",
        "TE"
      ],
      [
        "DE",
        "LETE"
      ],
      [
        "CA",
        "TLG"
      ],
      [
        ")",
        "),"
      ],
      [
        "I",
        "L"
      ],
      [
        "=",
        "&"
      ],
      [
        "G",
        "Y"
      ],
      [
        "I",
        "GY"
      ],
      [
        "O",
        "A"
      ],
      [
        "D",
        "BA"
      ],
      [
        "OA",
        "D"
      ],
      [
        "O",
        "P"
      ],
      [
        "OP",
        "S"
      ],
      [
        "G",
        "E"
      ],
      [
        "PRO",
        "C"
      ],
      [
        "CO",
        "N"
      ],
      [
        "OUT",
        "PUT"
      ],
      [
        "IN",
        "PUT"
      ],
      [
        "C",
        "H"
      ],
      [
        "A",
        "M"
      ],
      [
        "SYSUT",
        "1"
      ],
      [
        "TR",
        "K"
      ],
      [
        "M",
        "P"
      ],
      [
        "CO",
        "MP"
      ],
      [
        "D",
        "U"
      ],
      [
        "M",
        "MY"
      ],
      [
        "DU",
        "MMY"
      ],
      [
        "IE",
        "B"
      ],
      [
        "PRO",
        "D"
      ],
      [
        "L",
        "OAD"
      ],
      [
        "A",
        "B"
      ],
      [
        "C",
        "D"
      ],
      [
        "12",
        "CD"
      ],
      [
        "AB",
        "12CD"
      ],
      [
        "5",
        "00"
      ],
      [
        "55",
        "500"
      ],
      [
        "55500",
        "0"
      ],
      [
        "3",
        "4"
      ],
      [
        "5",
        "6"
      ],
      [
        "12",
        "34"
      ],
      [
        "1234",
        "56"
      ],
      [
        "0",
        "12"
      ],
      [
        "7",
        "8"
      ],
      [
        "9",
        "012"
      ],
      [
        "78",
        "9012"
      ],
      [
        "STEP",
        "LIB"
      ],
      [
        "0",
        "1"
      ],
      [
        "DA",
        "IL"
      ],
      [
        "DAIL",
        "Y"
      ],
      [
        "NE",
        "R"
      ],
      [
        "GE",
        "NER"
      ],
      [
        "IEB",
        "GENER"
      ],
      [
        "M",
        "AS"
      ],
      [
        "TE",
        "R"
      ],
      [
        "MAS",
        "TER"
      ],
      [
        "A",
        "W"
      ],
      [
        "R",
        "AW"
      ],
      [
        "ST",
        "G"
      ],
      [
        "W",
        "OR"
      ],
      [
        "TE",
        "ST"
      ],
      [
        "WOR",
        "K"
      ],
      [
        "UT",
        "IL"
      ],
      [
        "ID",
        "X"
      ],
      [
        "E",
        "A"
      ],
      [
        "Y",
        "EA"
      ],
      [
        "U",
        "SE"
      ],
      [
        "USE",
        "R"
      ],
      [
        "YEA",
        "R"
      ],
      [
        "ETL",
        "OPS"
      ],
      [
        "IN",
        "G"
      ],
      [
        "ACCT",
        "ING"
      ],
      [
        "C",
        "RE"
      ],
      [
        "OPS",
        "CRE"
      ],
      [
        "OPSCRE",
        "W"
      ],
      [
        "TE",
        "AM"
      ],
      [
        "RPT",
        "TEAM"
      ],
      [
        "P",
        "Y"
      ],
      [
        "CO",
        "PY"
      ],
      [
        "EX",
        "TR"
      ],
      [
        "L",
        "IN"
      ],
      [
        "JOB",
        "00"
      ],
      [
        "MY",
        "JOB00"
      ],
      [
        "MYJOB00",
        "1"
      ],
      [
        "E",
        "M"
      ],
      [
        "M",
        "EM"
      ],
      [
        "SE",
        "T"
      ],
      [
        "RE",
        "CON"
      ],
      [
        "RECON",
        "JOB"
      ],
      [
        "B",
        "T"
      ],
      [
        "ACCT",
        "BT"
      ],
      [
        "ACCTBT",
        "CH"
      ],
      [
        "ETL",
        "EXTR"
      ],
      [
        "ETLEXTR",
        "3"
      ],
      [
        "N",
        "01"
      ],
      [
        "RPT",
        "GE"
      ],
      [
        "RPTGE",
        "N01"
      ],
      [
        "D",
        "L"
      ],
      [
        "YL",
        "OAD"
      ],
      [
        "DL",
        "YLOAD"
      ],
      [
        "DLYLOAD",
        "2"
      ],
      [
        "SYSUT",
        "2"
      ],
      [
        "E",
        "S"
      ],
      [
        "F",
        "Y"
      ],
      [
        "I",
        "FY"
      ],
      [
        "L",
        "T"
      ],
      [
        "L",
        "SE"
      ],
      [
        "N",
        "O"
      ],
      [
        "R",
        "LSE"
      ],
      [
        "T",
        "IFY"
      ],
      [
        "U",
        "ID"
      ],
      [
        "SYS",
        "UID"
      ],
      [
        "IN",
        "FILE"
      ],
      [
        "OUT",
        "FILE"
      ],
      [
        "STEP",
        "2"
      ],
      [
        "PROC",
        "ES"
      ],
      [
        "CON",
        "D"
      ],
      [
        "NO",
        "TIFY"
      ],
      [
        "PROCES",
        "S"
      ],
      [
        ")",
        ")"
      ],
      [
        "0",
        "M"
      ],
      [
        "C",
        "R"
      ],
      [
        "C",
        "TL"
      ],
      [
        "G",
        "I"
      ],
      [
        "O",
        "N"
      ],
      [
        "P",
        "ASS"
      ],
      [
        "SYS",
        "LIN"
      ],
      [
        "RE",
        "GI"
      ],
      [
        "IGY",
        "CR"
      ],
      [
        "COMP",
        "ILE"
      ],
      [
        "REGI",
        "ON"
      ],
      [
        "IGYCR",
        "CTL"
      ],
      [
        "1",
        "0"
      ],
      [
        "F",
        "IE"
      ],
      [
        "L",
        "DS"
      ],
      [
        "SORT",
        "IN"
      ],
      [
        "SORT",
        "OUT"
      ],
      [
        "SORT",
        "STEP"
      ],
      [
        "FIE",
        "LDS"
      ],
      [
        "S",
        "IGY"
      ],
      [
        "SIGY",
        "COMP"
      ],
      [
        "SYS",
        "LIB"
      ],
      [
        "UN",
        "DE"
      ],
      [
        "UNDE",
        "F"
      ],
      [
        "CA",
        "MS"
      ],
      [
        "ID",
        "CAMS"
      ],
      [
        "N",
        "AM"
      ],
      [
        "BA",
        "D"
      ],
      [
        "NAM",
        "E"
      ],
      [
        "O",
        "V"
      ],
      [
        "R",
        "DD"
      ],
      [
        "OV",
        "RDD"
      ],
      [
        "(",
        "&"
      ],
      [
        "R",
        "UN"
      ],
      [
        "C",
        "E"
      ],
      [
        "I",
        "CE"
      ],
      [
        "O",
        "L"
      ],
      [
        "O",
        "OL"
      ],
      [
        "T",
        "OOL"
      ],
      [
        "ICE",
        "TOOL"
      ],
      [
        "1",
        "4"
      ],
      [
        "B",
        "R"
      ],
      [
        "F",
        "BR"
      ],
      [
        "IE",
        "FBR"
      ],
      [
        "IEFBR",
        "14"
      ],
      [
        "E",
        "F"
      ],
      [
        "I",
        "K"
      ],
      [
        "J",
        "EF"
      ],
      [
        "T",
        "01"
      ],
      [
        "IK",
        "JEF"
      ],
      [
        "IKJEF",
        "T01"
      ],
      [
        "PRO",
        "G"
      ],
      [
        ".",
        "."
      ],
      [
        "(",
        "),'"
      ],
      [
        "IEB",
        "COPY"
      ],
      [
        "RPT",
        "PROC"
      ],
      [
        "ETL",
        "PROC"
      ],
      [
        "H",
        "LI"
      ],
      [
        "IE",
        "HLI"
      ],
      [
        "IEHLI",
        "ST"
      ],
      [
        "MY",
        "PROC"
      ],
      [
        "DE",
        "V"
      ],
      [
        "@",
        "@"
      ],
      [
        "CON",
        "T"
      ],
      [
        "K",
        "LIB"
      ],
      [
        "LIN",
        "KLIB"
      ],
      [
        ".",
        ","
      ],
      [
        "1",
        "BAD"
      ],
      [
        "AC",
        "T"
      ],
      [
        "EXTR",
        "ACT"
      ],
      [
        "A",
        "IN"
      ],
      [
        "M",
        "AIN"
      ],
      [
        "D",
        "R"
      ],
      [
        "E",
        "R"
      ],
      [
        "I",
        "V"
      ],
      [
        "DR",
        "IV"
      ],
      [
        "DRIV",
        "ER"
      ],
      [
        "P",
        "ORT"
      ],
      [
        "RE",
        "PORT"
      ],
      [
        "L",
        "OA"
      ]
    ]
  }
}